# 4.0 Exercise

## SQL, sqlalchemy, aggregation

In [1]:
from sqlalchemy import create_engine
import pandas as pd

connect_param = 'postgresql://dsi_student:gastudents@dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com:5432/dsi'

engine = create_engine(connect_param)

pd.read_sql("SELECT * FROM pg_catalog.pg_tables WHERE schemaname='public'", con=engine)

  schemaname tablename   tableowner tablespace hasindexes hasrules hastriggers
0     public   housing          dsi       None       True    False       False
1     public     users  dsi_student       None       True    False       False

In [2]:
pd.read_sql("SELECT * FROM housing limit 10", con=engine)

   index  sqft  bdrms  age   price
0      0  2104      3   70  399900
1      1  1600      3   28  329900
2      2  2400      3   44  369000
3      3  1416      2   49  232000
4      4  3000      4   75  539900
5      5  1985      4   61  299900
6      6  1534      3   12  314900
7      7  1427      3   57  198999
8      8  1380      3   14  212000
9      9  1494      3   15  242500

## Questions (in SQL!):

What's the average price for apartments?

In [4]:
query = "select avg(price) from housing;"
pd.read_sql(query, con=engine)

             avg
0  340412.659574

What's the average price for 2 bedrooms apartments?

In [5]:
query = "select avg(price) from housing where bdrms=2;"
pd.read_sql(query, con=engine)

             avg
0  280866.666667

What's the average price per room for 3 bedroom apartments?

In [20]:
query = "select avg(price)/3 from housing where bdrms=3;"
pd.read_sql(query, con=engine)

        ?column?
0  108801.306667

What's the most frequent number of bedrooms?

In [24]:
query = "select count(bdrms), bdrms from housing group by bdrms order by count desc limit 1;"
pd.read_sql(query, con=engine)

   count  bdrms
0     25      3

How many apartments are there of that kind?

What fraction of the total number are of that kind?

In [36]:
query = "select bdrms,count(bdrms)*1.0/(select count(*) from housing) from housing group by bdrms order by count(bdrms) desc limit 1;"
pd.read_sql(query, con=engine)

   bdrms  ?column?
0      3  0.531915

How old is the oldest 3 bedrooms apartment?

In [27]:
query ="select max(age) from housing where bdrms=3;"
pd.read_sql(query, con=engine)

   max
0   78

How old is the youngest apartment?

In [28]:
query ="select min(age) from housing;"
pd.read_sql(query, con=engine)

   min
0    5

What's the average age for the whole dataset?

In [29]:
query ="select avg(age) from housing;"
pd.read_sql(query, con=engine)

         avg
0  42.744681

What's the average age for each bedroom size?

In [32]:
query ="select bdrms,avg(age) from housing group by bdrms;"
pd.read_sql(query, con=engine)

   bdrms        avg
0      1   5.000000
1      3  38.360000
2      4  46.857143
3      2  56.666667
4      5  49.000000

# Bonus

Connect this table up to Tableau and perform the same exploration there! It's all coming together! In this case, you can just make the SQL query in Tableau `select * from housing`.

Note that the SQLalchemy engine is set up with the following format: `dialect://username:password@host:port/database`
where host corresponds to server in the Tableau field (i.e. when you select connect to Postgresql table as the data source).

However, I initially received an error when I tested this owing to missing drivers. If you also get this you can
follow the link provided in the error message and download the drivers file (140MB). Once downloaded you can install
the postgresql drivers and it should work a charm.